<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Antoine Rey">
   <meta name="GENERATOR" content="Mozilla/4.7 [fr] (Win98; I) [Netscape]">
   <title>Nains - Ze Game</title>
</head>
<body background="bitmap/gentle_06.jpg">
<a NAME="ContactDeb"></a>
<table BORDER=0 CELLPADDING=0 >
<tr>
<td VALIGN=TOP WIDTH="180" BGCOLOR="#9999CC"><img SRC="bitmap/logo-purple.jpg" HSPACE=4 VSPACE=3 height=152 width=165>
<hr>
<center>
<p><b><u><font color="#000000"><a href="index.html">HOME</a></font></u></b>
<br><a href="news.html">News</a>
<br><a href="features.html">Features</a>
<br>&nbsp;<a href="ScreenShots.html">Screen Shots</a>
<br><a href="Tools.html">Tools</a>
<br><a href="http://antoine.rey.free.fr/download.html">Download</a>
<br><b><font color="#660000">> <u>Contact</u> &lt;</font></b>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p><a href="#HomeDeb"><img SRC="bitmap/sprite-nain.gif" BORDER=0 height=91 width=100 align=TEXTTOP></a></center>
</td>

<td WIDTH="100%">
<blockquote>
<h1>
Equipe de d&eacute;veloppement</h1>

<p><br>Pr&eacute;sentation et r&ocirc;le de chacun des 3 membres de ZeGame
<br>&nbsp;
<p><b>Antoine Rey&nbsp;</b>
<p>Etudiant en 2<sup>nde</sup> ann&eacute;e du d&eacute;partement informatique
de l’<font size=-1>INSA</font> de Lyon, cet &eacute;trange bonhomme est
passionn&eacute; par la programmation et tout particuli&egrave;rement par
tout ce qui touche au jeu vid&eacute;o. D&eacute;veloppant de p’tis jeux
et de ch’tites routines graphiques &agrave; ses heures perdues, il s’est
lanc&eacute; depuis plus d’un an dans le d&eacute;veloppement des <i>Nains</i>
qu’il a programm&eacute; jour apr&egrave;s jour, qu'il peaufine&nbsp; mois
apr&egrave;s mois et qu'il bichonnera sans rel&acirc;che, du moins je l'esp&egrave;re,
ann&eacute;e apr&egrave;s ann&eacute;e.&nbsp;
<br>Programmeur principal du jeu, il s’est charg&eacute; de r&eacute;aliser
non seulement le moteur global du jeu, mais aussi tous les outils n&eacute;cessaires
&agrave; la cr&eacute;ation des cartes, d&eacute;cors et animations. Le
tout d&eacute;velopp&eacute; sur C<sup>++</sup> Builder de Borland et Visual
C<sup>++</sup> 6 de Microsoft.
<br>N'h&eacute;sitez pas &agrave; le joindre &agrave;&nbsp; l'adresse suivante
: <a href="mailto:antoine.rey@insa-lyon.fr">antoine.rey@insa-lyon.fr</a>
<br>&nbsp;
<p><b>Jo&euml;l Mouclier</b>
<p>Dessinateur de BD avant tout (Semio, Dragons aux &eacute;ditions Delcourt),
remarquable infographiste aux immenses talents d&eacute;cuplants chaque
jour, il travaille depuis quelque mois chez infogrames, dans leur labo
<i>techlab</i>
de recherche et de d&eacute;veloppement.
<br>Il a r&eacute;alis&eacute; tous les graphismes du jeu : animations,
textures, logos, ... sous diff&eacute;rents logiciels tel 3D Studio Max,
Photoshop ou encore le non moins connu ProMotion, digne successeur de Deluxe
Paint. De plus, &agrave; travers ses œuvres artistiques, c’est lui qui
est &agrave; l’origine de l’ambiance du jeu et de son univers surr&eacute;aliste.
<br>Pour lui faire un petit coucou, y'a pas 36 choses &agrave; faire :
<a href="mailto:jojot@club-internet.fr">jojot@club-internet.fr</a>
<br>Et pour de plus amples informations : <a href="http://www.ifrance.com/jojotonic/">www.ifrance.com/jojotonic</a>
<br>&nbsp;
<p><b>Guy-Roger Duvert</b>
<p>Musicien par passion, il compose toutes sortes d’œuvres musicales, que
ce soit pour des pi&egrave;ces de th&eacute;&acirc;tre de quartier, des
petits montages vid&eacute;os ou encore des ambiances musicales destin&eacute;es
&agrave; accompagner des parties enchant&eacute;es de jeu de r&ocirc;le.
<br>Dans ZeGame, il a d&eacute;j&agrave; compos&eacute; deux musiques originales
intitul&eacute;es &laquo; Plaines &raquo; et &laquo; Machines &raquo;.
Celles-ci ont &eacute;t&eacute; en partie produites sur un expandeur&nbsp;
Roland et un bon vieux logiciel tournant sous <font size=-1>DOS</font>
nomm&eacute; Cakewalk.
<br>Si vous avez des questions : <a href="mailto:grmuse@yahoo.fr">grmuse@yahoo.fr</a>
<br>Et pour vraiment tout savoir sur lui et ses passions, y'a qu'une seule
chose &agrave; faire <a href="http://www.ifrance.com/musiquegr/">www.ifrance.com/musiquegr</a>
<br>&nbsp;</blockquote>
</td>
</tr>
</table>

</body>
</html>
