<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Antoine Rey">
   <meta name="GENERATOR" content="Mozilla/4.51 [en] (WinNT; U) [Netscape]">
   <title>Nains - Ze Game</title>
</head>
<body background="bitmap/background-white.jpg">
<a NAME="Beginning"></a> &nbsp; 
<table border=0 cols=4 width="93%" >
  <tr> 
    <td valign=TOP width="53%"><font face="Times New Roman,Times"><font color="#008080"><font size=+3>News</font></font></font></td>
    <td width="2%"></td>
    <td width="20%"></td>
    <td width="25%"> 
      <center>
        <img src="bitmap/anim-heroplg.gif" height=86 width=53> 
      </center>
    </td>
  </tr>
</table>
<br>
<table width="93%" border="0">
  <tr>
    <td>
      <p>Sur cette page on y retrouve toutes les derni&egrave;res informations 
        concernant non seulement les nouveaut&eacute;s de ce site, mais surtout 
        sur l'&eacute;volution de la version alpha du jeu. Elle permettra donc 
        de voir si le jeu progresse au moins un 'tit peu et si tel n'est pas le 
        cas pour que vous puissiez me le rappeler. J'essayerai de le compl&eacute;ter 
        le plus souvent possible d&egrave;s que des changements auront eu lieu. 
        De plus, je ferai un petit bilan toutes les ??? semaines plus pour moi 
        m&ecirc;me pour suivre ce qui a &eacute;t&eacute; fait depuis la derni&egrave;re 
        fois. 
      <p>Ce qui pourrait venir &agrave; para&icirc;tre dans quelques temps sur 
        ce site serait une page sur l'historique du projet, &agrave; savoir comment 
        il a &eacute;volu&eacute; depuis ses 1<sup>er</sup> pas en juin 1998. 
        On pourra aussi bient&ocirc;t y voir des brides d'infos sur la programmation, 
        de sources du jeu et des liens vers des sites plus ou moins connus. Et 
        bien s&ucirc;r, enfin j'esp&egrave;re, la partie download devrait s'aggrandir 
        et r&eacute;guli&egrave;rement pr&eacute;senter une version un peu plus 
        stable et un peu plus jouable. Bref, &ccedil;&agrave; c'est les bonnes 
        r&eacute;solutions de cette prochaine ann&eacute;e et on verra bien ce 
        qu'il en adviendra. 
    </td>
  </tr>
</table>
<p>&nbsp;  
<table border=0 cellspacing=2 cellpadding=2 cols=1 width="93%" >
  <tr>
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;01-Janvier-2020</font><font color="#FFFFFF">&nbsp;Déménagement sur GitHub</font></td>
  </tr>
  <tr>
    <td height="63">2 décennies après avoir publié le code source de ZeGame sur SourceForge, le voici désormais disponible pour la postérité sur GitHub. Il était temps !
    </td>
  </tr>
  <tr>
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;27-Janvier-2002</font><font color="#FFFFFF">&nbsp;
      Le revoil&agrave;</font></td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;08-Novembre-2007</font><font color="#FFFFFF">&nbsp;Compatibilit&eacute; Firefox</font></td>
  </tr>
  <tr>
    <td height="63">Plus de 5 ans apr&egrave;s la derni&egrave;re mise &agrave; jour du site Web, je me suis dit qu'il &eacute;tait n&eacute;cessaire de rendre compatible le menu principal avec Firefox (et oui, &agrave; l'&eacute;poque, IE et Netscape reignaient en ma&icirc;tre). Chose faite pour les quelques visiteurs qui passent encore par ici.</td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;27-Janvier-2002</font><font color="#FFFFFF">&nbsp; 
      Le revoil&agrave;</font></td>
  </tr>
  <tr>
    <td height="63">Suite &agrave; bon nombre de mails souhaitant avoir acc&egrave;s 
      &agrave; la d&eacute;mo et aux sources de ZeGame, je viens de migrer l'emplacement 
      site sur free. Je tiens tout de m&ecirc;me &agrave; remercier mon ex-h&eacute;bergeur 
      Babeloueb qui a ferm&eacute; ses portes l'&eacute;t&eacute; dernier.</td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;05-Juin-2001</font><font color="#FFFFFF">&nbsp; 
      ZeGame - Downloads v1.75</font></td>
  </tr>
  <tr> 
    <td height="105"> 
      <p>Apr&egrave;s quelques probl&egrave;mes avec mon PC, comme promis, voici 
        de quoi vous mettre sous la dent entre 2 matchs de Tennis.</p>
      <p>Et oui, une nouvelle version multi-joueurs de ZeGame est dispo <a href="download_en.html#DemoDownloads">ici</a>.
        Ceux qui ont acces au Net pourront desormais se connecter automatiquement 
        a une session si un serveur est disponible quelque part sur Terre.</p>
      <p>Et une surprise n'arrivant jamais seule avec Tonio, les <a href="download_en.html#GameSources">sources</a> 
        de cette demo sont elles aussi telechargeables.</p>
    </td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;16-April-2001</font><font color="#FFFFFF">&nbsp; 
      ZeGame - Interview</font></td>
  </tr>
  <tr> 
    <td height="112"> 
      <p>Et oui, ca faisait un p'tit bout de temps que je n'avais pas mis &agrave;jour 
        ce site : pr&egrave;s de 4 mois ... signe de la triste (sniff...) perte 
        de vitesse de ZeGame. Quoi qu'il en soit, le projet est toujours plus 
        ou moins en cours de d&eacute;veloppement et vous aurez tr&egrave;s prochainement 
        une nouvelle version sous la dent.<br>
        En attendant, un peu de lecture avec cet <a href="http:%5C%5Cwww.levillage.org%5Cecho%5C135%5C1071.cbb">interview</a> 
        r&eacute;alis&egrave;e en f&eacute;vrier dernier par Tendencies et disponible
        sur les echos de <a href="http:%5C%5Cwww.levillage.org">www.levillage.org</a></p>
    </td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;20-November-2000</font><font color="#FFFFFF">&nbsp; 
      ZeGame - Downloads</font></td>
  </tr>
  <tr> 
    <td height="59">Les sources des 4 outils de developpements (BuildPakFile, 
      MapEditor, TileEditor et AnimEditor) sont dorenavants disponibles dans la 
      section download.</td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF">&nbsp;&nbsp;&nbsp;3-November-2000</font><font color="#FFFFFF">&nbsp; 
      ZeGame - Downloads</font></td>
  </tr>
  <tr> 
    <td height="59"> 
      <p>Aujourd'hui, 2 petits correctifs : l'<a href="https://github.com/arey/zegame/releases/download/v1.70/ZeGame-v1.70a-patch.zip">un</a>
        sur la demo qui pouvait planter des son lancemenent chez certains,
        l'<a href="https://github.com/arey/zegame/releases/download/v1.70/ZeGame-Sources-v1.70-Add-on.zip">autre</a>
        sur des sources du jeu manquantes (debug.c, wave.c ...)</p>
    </td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#66FFFF"> &nbsp;&nbsp;&nbsp;&nbsp;14-October-2000</font><font color="#FFFFFF">&nbsp; 
      ZeGame - Downloads</font></td>
  </tr>
  <tr> 
    <td height="42"> 
      <p>Apres tant d'attente, le kit de developpement de ZeGame et les sources 
        du jeu sont enfin disponible en telechargement ! </p>
    </td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#FFFFFF"> </font><font color="#66FFFF"> 
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 3-October-2000</font><font color="#FFFFFF">&nbsp; 
      Le ZeGame nouveau est arrive</font></td>
  </tr>
  <tr> 
    <td height="155"> 
      <p>Et voila ! comme prevu et comme vous avez du vous en appercevoir, le 
        nouveau site de ZeGame est now online. Certe quelques liens sont encore 
        casses et des pages sont a moities remplies, mais bon ca devrait s'arranger 
        d'ici quelques jours.</p>
      <p>Ce relook du web site s'accompagne d'une nouvelle version beta de ZeGame 
        (la 1.70b tres exactement) carrement plus light (en ko parlant) que vous 
        pourrez downloader dans la section download.<br>
        Et bientot, ZeSdk devrait etre lui aussi downloadable ainsi que les sources 
        du jeu, donc soyez vigilant ...</p>
    </td>
  </tr>
  <tr> 
    <td bgcolor="#008080" height="22"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">17-August-2000</font><font color="#FFFFFF">&nbsp; 
      WebSite &amp; ZeGame - Hot News</font></td>
  </tr>
  <tr> 
    <td height="212"> 
      <p>Bon voila, ca faisait un vraiment un bon petit moment que je n'avais 
        pas mis a jour ce site web, ni parle de l'avancement du projet, mais rassurez-vous, 
        en voici en grand nombre :<br>
      </p>
      <blockquote> 
        <p><u>Cote site web</u> : </p>
      </blockquote>
      <ul>
        <li>sur la page principale, j'ai rajoute un <a href="usa/usa.htm">lien</a> 
          vers quelques photos prises lors de mes escursions en Californie,</li>
        <li>un redesign partiel du site web est en cours et devrait etre mis en 
          ligne dans un mois,</li>
        <li>les divers outils (Map, Tile &amp; Anim Editors) permettant de creer 
          des niveaux pour ZeGame vont bientot pouvoir etre telecharge afin de 
          faire travailler un peu votre imagination,</li>
        <li>dans ce cadre, je suis en train d'ecrire leur documentation, qui sera 
          biensure mis a votre disposition sur le web. </li>
        <p><u>Cote Jeu</u> :</p>
        <li>les musiques seront desormais au format mp3 ce qui va devoir amplement 
          diminuer la taille de la demo,</li>
        <li>et de nombreux bruitages vont bientot contribuer a l'ambiance du jeu. 
        </li>
      </ul>
      <p>&nbsp;</p>
    </td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">10-May-2000</font><font color="#FFFFFF">&nbsp; 
      USA</font></td>
  </tr>
  <tr> 
    <td height="89">Salut tout le monde, voici la 1ere MaJ du site faite en direct 
      live a partir des states d IBM, quoi de 9 ? et bien, des a present, je vous 
      conseille d utiliser l url <a href="https://arey.github.io/zegame/">www.zegame.net</a>
      (plutot qu' antoine.rey.free.fr) qui est mon nouvel hebergeur. <br>
      De plus, le lien dans les dowmload vers l'alpha demo du jeu (v1.62) marche 
      enfin.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">19-Apr-2000</font><font color="#FFFFFF">&nbsp; 
      ZeGame - The last revelation</font></td>
  </tr>
  <tr> 
    <td height="71">Et bah oui, ce qui devait arriver un jour et bel et bien l&agrave;, 
      la nouvelle version est enfin dispo en download d&egrave;s &agrave; pr&eacute;sent 
      alors n'attendez plus ... Comme vous pourrez le voir, elle inclue un nouveau 
      niveau dans lequel vous pourrez vous ballader &agrave; votre guise.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">18-Apr-2000</font><font color="#FFFFFF">&nbsp; 
      ZeGame - always a new hope</font></td>
  </tr>
  <tr> 
    <td height="66">Il est tout juste 2h du mat' et je me l&egrave;ve ds moins 
      de 3h pour partir &agrave; blois faire ma 1/2 journ&eacute;e; je tenais 
      cependant &agrave; vous dire (avant d'aller sauter sur une mine) que la 
      nouvelle version beta que j'ai entre les mains est presque op&eacute;rationelle.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">14-Apr-2000</font><font color="#FFFFFF">&nbsp; 
      WebSite - &agrave; quand le livre d'or</font></td>
  </tr>
  <tr> 
    <td height="45">Je suis en train de regarder comment faire pour installer 
      facilement (sans trop me prendre la t&ecirc;te) un guestbook chez free pour 
      que vous puissiez &agrave; l'avenir directement vous exprimer online.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">26-Mar-2000</font><font color="#FFFFFF">&nbsp; 
      WebSite - a new hope</font></td>
  </tr>
  <tr> 
    <td height="158">Si vous lisez cette news, c'est que vous parcourez la "nouvelle" 
      version du site h&eacute;berg&eacute;e &agrave; pr&eacute;sent sur <a href="http://www.babeloueb.com">Babeloueb</a>, 
      le 1er portail d&eacute;di&eacute; totalement aux jeux vid&eacute;os o&ugrave; 
      peuvent s'inscrire guildes ou f&eacute;rus de jeux, o&ugrave; vous retrouverez 
      tout plein de news sur le monde du jeu vid&eacute;o, o&ugrave; vous pourrez 
      m&ecirc;me y passer vos propres tests, vos news et vos PA ... bref ca sera 
      plus simple d'aller y faire un tour ! <br>
      Y'a pas de grands changements par rapport &agrave; l'ancienne version (un 
      gif de plus :-) mais ca ne devrait pas tarder ds les semaines &agrave; venir 
      avec qui sait une nouvelle version alpha de la d&eacute;mo, alors surveillez 
      bien ...</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">13-Mar-2000</font><font color="#FFFFFF">&nbsp; 
      Infos minimes</font></td>
  </tr>
  <tr> 
    <td height="47">- Pour tous ceux qui n'ont pas achet&eacute; Joy, voici qd 
      m&ecirc;me un <a href="bitmap/milia/Milia2000-joystick.jpg">scan</a> de 
      la page me concernant. <br>
      - De plus, d'ici quelque temps, ce site risque de se faire h&eacute;berger 
      par <a href="http://www.babeloueb.com">Babeloueb</a></td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">04-Mar-2000</font><font color="#FFFFFF">&nbsp; 
      News about Joystick + CanalWeb</font></td>
  </tr>
  <tr> 
    <td>Me voici de retour &agrave; la dur r&eacute;alit&eacute; apr&egrave;s 
      2 semaines de pure bonheur avec le Milia d'une part et les vacances d'autre 
      part.&nbsp; <br>
      Heureusement, j'ai tout de m&ecirc;me r&eacute;ussi &agrave; survivre de 
      cette semaine infernale pour vous relater ces 2 infos : <br>
      - dans le Joystick du mois de mars, &agrave; la page 16 des news tr&egrave;s 
      exactement, vous trouverez une screenshot de ZeGame, <br>
      - et sur le site de canalweb, je vous conseille de matter l'<a href="http://www.canalweb.com/cwsite/cw/cw08.asp">&eacute;mission 
      JVTV du 22 f&eacute;vrier</a> dernier diffus&eacute;e &agrave; 22h30 (rubrique 
      jeu) et &agrave; laquelle j'ai&nbsp; nottamment particip&eacute; apr&egrave;s 
      avoir eu l'occasion de rencontrer S&eacute;bastien au Milia.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">24-Feb-2000</font><font color="#FFFFFF">&nbsp; 
      Milia 2000</font></td>
  </tr>
  <tr> 
    <td>En attendant que je sois rentr&eacute; &agrave; l'Insa, voici quand m&ecirc;me 
      un lien vers quelques photos prises au Milia 2000 o&ugrave; tout s'est vraiment 
      d&eacute;roul&eacute; pour le mieux entre soleil, conf&eacute;rences, cockails, 
      soir&eacute;e techno, rencontres en tout genre ... <br>
      Pour le voir avec vos popres yeux : <a href="milia2000.html">Milia 2000</a></td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">13-Feb-2000</font><font color="#FFFFFF">&nbsp; 
      ZeGame</font></td>
  </tr>
  <tr> 
    <td>J'ai boss&eacute; toute cette semaine sur un nouveau niveau du jeu, beaucoup 
      plus interractif que le pr&eacute;c&eacute;dent (big.niv). Il int&egrave;gre 
      en effet une gestion plus compl&egrave;te des scripts sc&eacute;naritiques 
      et de la gestion des zones au sol. <br>
      Cependant, je suis confront&eacute; depuis hier &agrave; des bugs intempestifs 
      qui font compl&egrave;tement planter ma machine (red&eacute;marrage assur&eacute;) 
      et je ne sais m&ecirc;me pas d'o&ugrave; ils peuvent venir. <br>
      Mais rassurez-vous car normalement, un peu apr&egrave;s le Milia, je devrais 
      mettre en ligne ce nouveau niveau ainsi que la version corrig&eacute;e de 
      tout craquement de la musique intitul&eacute;e "<i>plaines</i>".</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">12-Feb-2000</font><font color="#FFFFFF">&nbsp; 
      Milia 2000</font></td>
  </tr>
  <tr> 
    <td>Vous savez quoi ? ... non ? ... et bien vous pourrez me retrouver du mardi 
      15 f&eacute;vrier au vendredi 18 au palais des Festivals &agrave; Cannes 
      au salon du <a href="http://www.milia.com/">Milia</a>. Donc rendez-vous 
      l&agrave;-bas au stand <i>ZeGame</i> au developpers village. Aller jeter 
      un coup d'oeil &agrave; l'adresse : <a href="http://www.milia.com/news/news.shtml#and">http://www.milia.com/news/news.shtml#and</a>. 
      <br>
      En fait, j'ai gagn&eacute; &agrave; un concours organis&eacute; par <a href="http://www.joystick.fr">Joystick</a> 
      dont je remercie au passage toute l'&eacute;quipe.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp; </font><font color="#66FFFF">24-Jan-2000</font><font color="#FFFFFF">&nbsp; 
      Website - modifs mineures&nbsp; /&nbsp; ZeGame - petits pas</font></td>
  </tr>
  <tr> 
    <td>- Ajouts de metatags et de javascripts <br>
      - Commencement du d&eacute;but de la gestion des zones au sol (jeu + &eacute;diteur)</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">8-Jan-2000</font><font color="#FFFFFF">&nbsp; 
      Website - modifs</font></td>
  </tr>
  <tr> 
    <td>Rajout de papiers peints, de scripts php3 et d'un logo ki tourne sous 
      DirectAnimation (pour ceux sous IE).</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">2-Jan-2000</font><font color="#FFFFFF">&nbsp;&nbsp; 
      ZeGame - version alpha 1.0 en download</font></td>
  </tr>
  <tr> 
    <td>Suite &agrave; la sortie du site sur le web, une version en cours de d&eacute;veloppement 
      du projet peu &ecirc;tre t&eacute;l&eacute;charg&eacute;e depuis la section 
      <i><a href="http://antoine.rey.free.fr/download.html">Download</a></i> pour 
      tout ceux que &ccedil;&agrave; int&eacute;resse.</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#FFFFFF">&nbsp;&nbsp; </font><font color="#66FFFF">2-Jan-2000</font><font color="#FFFFFF">&nbsp; 
      Website - 1<sup>st</sup> release</font></td>
  </tr>
  <tr> 
    <td>Ca y'est, c'est fait : je viens tout juste d'uploader tous les fichiers 
      (enfin presque) de ma page web sur mon compte perso chez Free que je remercie, 
      au passage,&nbsp; pour h&eacute;berger ma page.&nbsp; <br>
      Allez, je fais p&eacute;ter le Champagne (avec 2 jours de retard, mais l&agrave; 
      il est en promo &agrave; 38F chez carrouf::-)&nbsp;</td>
  </tr>
  <tr> 
    <td></td>
  </tr>
  <tr> 
    <td bgcolor="#008080"><font color="#66FFFF">&nbsp;19-Dec-1999</font><font color="#FFFFFF">&nbsp; 
      WebSite - the beginning</font></td>
  </tr>
  <tr> 
    <td>Pr&eacute;lude au commencement du d&eacute;but de la conception de cette 
      page web ayant &agrave; peu pr&egrave;s commen&ccedil;&eacute;&nbsp; juste 
      un peu avant que je ne tape ces quelques lignes.</td>
  </tr>
</table>
</body>
</html>
