<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Antoine Rey">
   <meta name="GENERATOR" content="Mozilla/4.7 [fr] (Win98; I) [Netscape]">
   <title>Nains - Ze Game</title>
</head>
<body background="bitmap/gentle_06.jpg">
<h1><a name="Beginning"></a>Equipe de d&eacute;veloppement</h1>
<p><br>
  Voici une pr&eacute;sentation succincte de chacun des 3 membres actifs de ZeGame 
  ainsi que leur r&ocirc;le : <br>
  &nbsp; 
<p><b><img src="icon/keyboard.gif" width="16" height="16" align="absmiddle"> Antoine 
  Rey&nbsp;</b> 
<p>Etudiant en 3iem ann&eacute;e du d&eacute;partement informatique de l’<font size=-1>INSA</font> 
  de Lyon, cet &eacute;trange bonhomme est passionn&eacute; par la programmation 
  et tout particuli&egrave;rement par tout ce qui touche au jeu vid&eacute;o. 
  D&eacute;veloppant de p’tis jeux et de ch’tites routines graphiques &agrave; 
  ses heures perdues, il s’est lanc&eacute; depuis plus de 2 ans dans le d&eacute;veloppement 
  des <i>Nains</i> qu’il a programm&eacute; jour apr&egrave;s jour, qu'il peaufine&nbsp; 
  mois apr&egrave;s mois et qu'il bichonnera sans rel&acirc;che, du moins je l'esp&egrave;re, 
  ann&eacute;e apr&egrave;s ann&eacute;e.&nbsp; <br>
<p><br>
  Programmeur principal du jeu, il a r&eacute;alis&eacute; non seulement le moteur 
  du jeu, mais aussi tous les outils n&eacute;cessaires &agrave; la cr&eacute;ation 
  des niveaux, d&eacute;cors et animations. Ses outils de d&eacute;veloppement 
  sont <i>C<sup>++</sup> Builder</i> de Borland et <i>Visual C<sup>++</sup> 6</i> 
  de Microsoft. De plus, pour tout ce qui est retouche d'images et d'effets sonores, 
  Pro Motion 4 et SoundForge 4.5 sont de vigeur.<br>
  <br>
  N'h&eacute;sitez pas &agrave; le joindre &agrave;&nbsp; l'adresse suivante : 
  <a href="mailto:antoine@javaetmoi.com">antoine@javaetmoi.com</a> <br>
  &nbsp; 
<p><b><img src="icon/palette.gif" width="16" height="16" align="absmiddle"> Jo&euml;l 
  Mouclier</b> 
<p>Illustrateur de BD avant tout (Semio, Dragons aux &eacute;ditions Delcourt), 
  remarquable infographiste aux immenses talents d&eacute;cuplants chaque jour, 
  il travaille depuis maintenant (deja !) un an &agrave; infogrames, dans leur 
  labo <i>Techlab</i> de recherche et de d&eacute;veloppement. <br>
  <br>
  Il a r&eacute;alis&eacute; tous les graphismes du jeu : animations, textures, 
  logos, ... sous diff&eacute;rents logiciels tel 3D Studio Max, Photoshop ou 
  encore le non moins connu ProMotion, digne successeur de Deluxe Paint. De plus, 
  &agrave; travers ses œuvres artistiques, c’est lui qui est &agrave; l’origine 
  de l’ambiance du jeu et de son univers surr&eacute;aliste. <br>
  <br>
  Pour lui dire un petit coucou, y'a pas 36 choses &agrave; faire : <a href="mailto:j.mouclier@laposte.net">j.mouclier@laposte.net</a>
  <br>
  Et pour de plus amples informations, aller jeter un oeil sur son site web : 
  <a href="http://jo.mouclier.free.fr/">http://jo.mouclier.free.fr/</a> <br>
  &nbsp; 
<p><b><img src="icon/musicnote.gif" width="16" height="16" align="absmiddle"> 
  Guy-Roger Duvert</b> 
<p>Musicien par passion, il compose toutes sortes d’œuvres musicales, que ce soit 
  pour des pi&egrave;ces de th&eacute;&acirc;tre de quartier, des petits montages 
  vid&eacute;os ou encore des ambiances musicales destin&eacute;es &agrave; accompagner 
  des parties enchant&eacute;es de jeu de r&ocirc;le. <br>
  <br>
  Dans ZeGame, il a d&eacute;j&agrave; compos&eacute; deux musiques originales 
  intitul&eacute;es &laquo; Plaines &raquo; et &laquo; Machines &raquo;. Celles-ci 
  ont &eacute;t&eacute; en partie produites sur un expandeur&nbsp; Roland et un 
  bon vieux logiciel tournant sous <font size=-1>DOS</font> nomm&eacute; Cakewalk. 
  <br>
<p><br>
  Si vous avez des questions : <a href="mailto:grmuse@yahoo.fr">grmuse@yahoo.fr</a> 
  <br>
  Et pour vraiment tout savoir sur lui et ses passions, y'a qu'une seule chose 
  &agrave; faire <a href="http://www.ifrance.com/musiquegr/">www.ifrance.com/musiquegr</a> 
<br>
</body>
</html>
